[
    {
        "key": "O1",
        "name": "Programmable Logic",
        "description": "In digital electronic systems, logic devices provide specific functions, including device-to-device interfacing, data communication, signal processing, data display, timing and control operations, and several other system functions. Logic devices can be fixed or programmable using a logic language.",
        "outcomes": [
          "Specify digital device behavior using programmable logic language.",
          "Design, synthesize, simulate, and implement logic on an actual programmable logic device."
        ],
        "topics": [
          "Hardware design and programming languages",
          "Programmable logic devices"
        ],
        "notes": ""
      },
      {
        "key": "O2",
        "name": "Computer Architecture",
        "description": "Computer architecture provides an organized computing framework to allow firmware and software to leverage computing capabilities and various system resources.",
        "outcomes": [
          "Describe how various computing components and system resources are interconnected within a processor.",
          "Assess the functionality and performance impact of processor design alternatives."
        ],
        "topics": [
          "Organization of computer and processor architectures",
          "Instruction set design alternatives",
          "Processor implementation",
          "Memory system hierarchy",
          "Buses",
          "I/O systems",
          "Factors affecting performance"
        ],
        "notes": ""
      },
      {
        "key": "O3",
        "name": "Microcontrollers",
        "description": "Microcontrollers represent a special class of computing systems that are typically small and simple computers with a processor core, limited memory, programmable input/output peripherals, and sensors. Microcontrollers are typically inexpensive, have little or no interface for human interaction, and have a fixed (often special-purpose) function with little to no change over their lifecycle.",
        "outcomes": [
          "Design and build a basic microcontroller application.",
          "Assess the limitations of a given microcontroller design."
        ],
        "topics": [
          "Instruction sets and architectures",
          "Microcontroller programming environments",
          "Special considerations for architecture limitations and real-time requirements",
          "Integrating microcontrollers into larger systems",
          "Security considerations"
        ],
        "notes": ""
      },
      {
        "key": "O4",
        "name": "Hardware Reverse Engineering",
        "description": "Hardware reverse engineering is the study of hardware hacking and dissecting electronic devices and embedded systems. Hardware reverse engineers probe hardware components to determine their functionality, inputs, outputs, and stored data.",
        "outcomes": [
          "Safely document hardware functionality using procedures such as probing, measuring, and data collection.",
          "Safely and directly modify hardware functionality.",
          "Describe common hardware attack vectors."
        ],
        "topics": [
          "Hardware reverse engineering methodology",
          "The use of tools and test measurement equipment",
          "Circuit board analysis and modification",
          "Embedded security",
          "Common hardware attack vectors"
        ],
        "notes": ""
      },
      {
        "key": "O5",
        "name": "Cyber Forensics",
        "description": "Cyber forensics focuses on the recovery and investigation of artifacts in networks, memory, and operating systems.",
        "outcomes": [
          "Determine the manner in which an operating system or application has been subverted.",
          "Recover deleted and intentionally hidden information from various types of media.",
          "Demonstrate proficiency with handling a large number of different kinds of devices.",
          "Identify forensic artifacts left by cyber attackers.",
          "Acquire a forensically sound image for investigation."
        ],
        "topics": [
          "Operating system forensics",
          "Device / media forensics",
          "Network forensics",
          "Memory forensics"
        ],
        "notes": "This KU focuses specifically on cyber forensic processes and technology (i.e., tools and techniques), not legal aspects (e.g., chain of custody, preparation of evidence for legal proceedings)."
      },      
      {
        "key": "O6",
        "name": "Wireless and Mobile Security",
        "description": "Wireless and mobile systems have become ubiquitous, and they can have significant impacts on system security and operation, especially due to the relative openness and erratic nature of the wireless environment. The dynamic and inconsistent connectivity of wireless requires unique approaches to networking in everything from user identification and authentication to message integrity and cipher synchronization.",
        "outcomes": [
          "Describe unique security and operational attributes in the wireless environment and their effects on network communication guarantees and protections.",
          "Demonstrate knowledge of common vulnerabilities and use of available tools.",
          "Describe effective (and ineffective) mechanisms for protecting commonly deployed wireless and mobile networks and corresponding protocols that are employed in these systems, including wireless link and infrastructure components."
        ],
        "topics": [
          "Stream and block ciphers and security protocols commonly used in wireless networks, what properties each one provides, and known limitations / vulnerabilities",
          "Security implementations in different wireless systems (e.g., GSM, LTE, WiFi, Bluetooth, RFID)",
          "Mobile identifiers and registration, device / user tracking, and protection of identifiers for anti-tracking",
          "Availability issues in wireless networks"
        ],
        "notes": ""
      },
      {
        "key": "O7",
        "name": "Virtualization",
        "description": "Virtualization technology has rapidly spread to become a core feature of enterprise environments, and is also deeply integrated into many server, client, and mobile platforms. It is also widely used in IT development, research, and testing environments. Virtualization is also a key technology in cyber security. As such a deep technical understanding of the capabilities and limitations of modern approaches to virtualization is critical to cyber operations.",
        "outcomes": [
          "Describe the technical mechanisms by which virtualization is implemented in a variety of environments, and their implications for cyber operations.",
          "Enumerate and describe the various interfaces between the hypervisors, VMs, physical and virtual hardware, management tools, networking, storage, and external environments."
        ],
        "topics": [
          "Type I and Type II architectures",
          "Virtualization Principles including efficiency, resource control and equivalence",
          "Virtualization techniques for code execution, including trap and emulate, binary translation, paravirtualization, and hardware-supported virtualization (e.g., Intel VMX)",
          "Management of memory in virtualized systems, including hardware supported memory management (e.g., EPT/SLAT), memory deduplication, and isolation of VM hypervisor and memory spaces",
          "Techniques for allocating storage (e.g., hard drives) to Virtual Machines, and the associated capabilities (e.g., snapshots)",
          "Techniques for associating hardware (virtual or physical) with virtual machines, including hardware-supported methods (e.g., SR-IOV) and device emulation",
          "Techniques for providing advanced virtualization capabilities, such as live-migration and live failover",
          "Internal and External Interfaces provided by virtualized platforms for management, monitoring, and internal communication/synchronization",
          "Snapshots, migration, failover"
        ],
        "notes": "Education focused on simply using VMs or virtualization platforms such as vSphere, HyperV, or VirtualBox is not sufficient to address this KU."
      },
      {
        "key": "O8",
        "name": "Cloud Security",
        "description": "Cloud resources are commonly used for a wide variety of use cases, including the provisioning of enterprise services, data processing and analysis, development and testing, and a wide variety of consumer-focused services. Cloud computing has implications for cyber operations not only as a potential target, but also as an extensive resource to bring relatively cheap computing power to solve problems (e.g. cracking passwords) which were previously too difficult.",
        "outcomes": [
          "Describe cloud service models and deployment modes and their suitability for various service tasks, including understanding security tradeoffs.",
          "Develop and deploy a task in an appropriate cloud environment, including addressing issues associated with deployment, configuration, management, scalability, and security."
        ],
        "topics": [
          "Essential characteristics of cloud platforms and the underlying technologies that enable them",
          "Common service, deployment, and management models and their associated tradeoffs",
          "Cloud infrastructure components and the interfaces they expose to internal and external processes",
          "Security implications of cloud computing, including issues associated with shared resources and multi-tenancy, extension of trust to include the cloud provider, and approaches to mitigating these issues",
          "Developing, deploying, and managing applications on deployed cloud infrastructure"
        ],
        "notes": ""
      },
      {
        "key": "O9",
        "name": "Critical Infrastructure Security",
        "description": "Industrial Control Systems (ICSs) and Supervisory Control and Data Acquisition (SCADA) systems are at the core of many critical infrastructure sectors in the United States. These systems use common components and are frequently interconnected; vulnerabilities can cause significant problems to their owner operators. Many ICSs have critical national security impacts, such as the electrical power grid as well as dams and water treatment facilities. Cyber operators should have knowledge of the attack and defense of ICSs.",
        "outcomes": [
          "Describe the components of ICS systems and how they are programmed.",
          "Describe the different network protocols used in the operation of ICS and SCADA systems and their security vulnerabilities.",
          "Use industry standard software such as the DHS CSET tool to aid in analysis of ICS systems at a compliance level."
        ],
        "topics": [
          "Programmable logic controllers (PLCs)",
          "Supervisory Control and Data Acquisition (SCADA) systems",
          "Distributed Control System (DCS)",
          "ICS communication protocols",
          "US Critical Infrastructure sectors and regulations by sector"
        ],
        "notes": ""
      },
      {
        "key": "O10",
        "name": "Cyber Risk Management",
        "description": "Risk management forms the basis for applying information system security principles to an operational environment, including an organization’s security culture and values.",
        "outcomes": [
          "Describe the methods used to identify, measure, and mitigate key information technology risks.",
          "Describe tasks associated with risk framing, assessment, response, and monitoring."
        ],
        "topics": [
          "Risk models (e.g., NIST SP 800-39)",
          "Risk processes (e.g., NIST SP 800-37)"
        ],
        "notes": ""
      },
      {
        "key": "O11",
        "name": "Game Theory",
        "description": "Cybersecurity is predicated on the existence of human adversaries. Therefore, adversarial thinking underlies both defensive and offensive cyber operations. Game theory is the study of strategic reasoning and is useful for anticipating the strategic actions of adversaries.",
        "outcomes": [
          "Define canonical game theoretical games.",
          "Describe the differences between traditional and behavioral game theory.",
          "Determine scenarios where behavioral game theory renders more accurate predictions than traditional game theory.",
          "Define the necessary conditions for a game theoretical scenario.",
          "Draw a normal form representation of a real-life strategic scenario.",
          "Identify the Nash equilibrium for basic normal form games.",
          "Apply best response analysis to solve game theoretical games.",
          "Define level-k strategies for games."
        ],
        "topics": [
          "Canonical game theoretical games",
          "Types of games",
          "Traditional game theory",
          "Behavioral game theory",
          "Utility preferences",
          "Normal form games",
          "Nash equilibrium",
          "Level-k reasoning"
        ],
        "notes": ""
      }
]