[
  {
    "name": "System Security",
    "key": "",
    "outcomes": [
      "Discuss the importance of a security policy.",
      "Explain what is meant by confidentiality, integrity, and availability.",
      "Describe what a penetration test is and why it is valuable.",
      "Discuss uses of system monitoring.",
      "Explain what resilience is and identify an environment in which it is important.",
      "Be able to write host and network intrusions documentation.",
      "Explain the relationship among a security group, system configuration, and procedures to maintain the security of the system.",
      "Describe the limits of anti-malware software such as antivirus programs.",
      "Describe physical and logical access control, and compare and contrast them.",
      "Distinguish between authorization and authentication.",
      "Explain why backups pose a potential security risk.",
      "Describe an access control list.",
      "Discuss the importance of validating requirements.",
      "Be able to explain the security implications of unclear or incomplete documentation of system operation.",
      "Discuss how to document a test that reveals a vulnerability.",
      "Discuss the basics of a disaster recovery plan.",
      "Explain the concepts of trust and trustworthiness",
      "Discuss how intrusion detection systems contribute to security.",
      "Discuss the importance of documenting proper installation and configuration of a system.",
      "Explain why different sites have different security policies.",
      "Explain what a security policy is, and its role in protecting data and resources."
    ]
  },
  {
    "name": "Data Security",
    "key": "",
    "outcomes": [
      "Compare and contrast variety of forensics tools.",
      "Describe the various techniques for data erasure.",
      "Explain how public key infrastructure supports digital signing and encryption and discuss the limitations/vulnerabilities.",
      "Explain the various authentication techniques and their strengths and weaknesses.",
      "Explain the concepts of authentication, authorization, access control, and data integrity.",
      "Describe the purpose of cryptography and list ways it is used in data communications.",
      "Explain the various possible attacks on passwords.",
      "Explain the goals of end-to-end data security.",
      "Describe which cryptographic protocols, tools and techniques are appropriate for a given situation.",
      "Describe what a digital investigation is, the sources of digital evidence, and the limitations of forensics.",
      "Discuss the dangers of inventing one’s own cryptographic methods.",
      "Describe the following terms: cipher, cryptanalysis, cryptographic algorithm, and cryptology, and describe the two basic methods (ciphers) for transforming plaintext in ciphertext."
    ]
  },
  {
    "name": "Component Security",
    "key": "",
    "outcomes": [
      "List common points of vulnerability in a component’s supply chain.",
      "Explain how the security of a system’s components might impact the security of the system.",
      "List several techniques for testing security properties of a component.",
      "List the phases of a component's lifecycle",
      "Give examples of several secure component design principles and explain how each protects the security of components.",
      "Describe ways in which the confidentiality of a component’s design may be compromised.",
      "Describe a technique for reverse engineering the functionality of an integrated circuit.",
      "Describe several techniques for protecting the design elements of an integrated circuit.",
      "Describe security risks in a component supply chain.",
      "Describe ways to learn information about component’s functionality with limited information about its design and implementation.",
      "Differentiate between unit and system testing.",
      "Explain the difference between static and dynamic analysis in reverse engineering software.",
      "List reasons why someone would reverse engineer a component.",
      "Describe ways to mitigate supply chain risks.",
      "List component design artifacts which may require protection."
    ]
  },
  {
    "name": "Connection Security",
    "key": "",
    "outcomes": [
      "Explain how transmission attacks are often implemented as attacks on components that provide the service of relaying information.",
      "Explain why a component requires at least one interface.",
      "Describe how an implementation could protect itself from a specified vulnerability in a specified standard interface.",
      "Explain why every physical interface has a corresponding software component to provide a corresponding software interface.",
      "Describe an exploit for a vulnerability of a physical interface provided.",
      "Discuss the need for common models and architectures in order to describe systems.",
      "Discuss how TCP/IP as a service is represented by different interfaces indifferent software systems.",
      "Explain why transmission attacks can often be viewed as connection attacks on network components (physical or software).",
      "Explain how software components are organized to represent logical layers in a standard model.",
      "Describe the components and interfaces of a networking standard provided.",
      "Explain how connection attacks can be understood in terms of attacks on software component interfaces.",
      "Discuss how the Internet 5 layer model can be viewed as software components and interfaces that represent levels of services encapsulated by lower-level services.",
      "Describe an attack on a specified node in a TCP/IP network given the description of a vulnerability.",
      "Describe a model of systems that consists of components and interfaces for connections.",
      "Describe how a specified standard interface could expose vulnerabilities in a software component that implements the interface.",
      "Explain why a hardware device is always modeled a physical component.",
      "List several examples of physical component interfaces with their associated vulnerabilities.",
      "List several standards that define models consisting of systems of components and interfaces."
    ]
  },
  {
    "name": "Software Security",
    "key": "",
    "outcomes": [
      "Explain the difference between static and dynamic analysis.",
      "Describe the importance of writing secure and robust programs.",
      "Identify common attack vectors.",
      "Explain the concept that because you can do it, it doesn’t mean you should do it.",
      "Discuss the implications of relying on open design or the secrecy of design for security.",
      "Discuss the need to update software to fix security vulnerabilities.",
      "Describe why each principle is important to security.",
      "Explain why input validation and data sanitization are necessary.",
      "Explain why security requirements are important.",
      "Explain the importance of correctly configuring software.",
      "Discuss the ethical issues in disclosing vulnerabilities.",
      "Discuss the ethics of thorough testing, especially corner cases.",
      "Explain the need to test software after an update but before the patch is distributed.",
      "Identify the needed design principle.",
      "Discuss a problem that static analysis cannot reveal.",
      "Identify the ethical effects and impacts of design decisions.",
      "List the three principles of security.",
      "Discuss a problem that dynamic analysis cannot reveal.",
      "Describe a buffer overflow and why it is a potential security problem.",
      "Describe the concept of privacy including personally identifiable information.",
      "Differentiate between secure coding and patching and explain the advantage of using secure coding techniques.",
      "Explain the difference between pseudorandom numbers and random numbers."
    ]
  },
  {
    "name": "Societal Security",
    "key": "",
    "outcomes": [
      "Summarize nation-specific cybersecurity public policy with respect to the protection of sensitive information and protection of critical infrastructure.",
      "Describe ways in which decision-making algorithms could over-represent or under-represent majority and minority groups in society",
      "Interpret intellectual property laws related to security.",
      "Describe the common practices and technologies used to safeguard personal privacy.",
      "Summarize laws governing online privacy.",
      "Summarize the tradeoff between the rights to privacy by the individual versus the needs of society.",
      "Describe international data security and computer hacking laws.",
      "Distinguish among virtue ethics, utilitarian ethics and deontological ethics.",
      "Discuss various motives for cybercrime behavior.",
      "Describe the constitutional foundations of cyber law.",
      "Paraphrase professional ethics and codes of conduct from prominent professional societies, such as ACM, IEEE-CS, AIS and (ISC)",
      "Explain global impact of cybersecurity to culture including areas such as the economy, social issues, policy and laws.",
      "Explain why preserving the chain of digital evidence is necessary in prosecuting cybercrimes.",
      "Describe methods for investigating both domestic and international crimes.",
      "Summarize terror activities in cyberspace geared toward generating societal fear and certainty.",
      "Describe the concept of privacy including the societal definition of what constitutes personally private information and the tradeoffs between individual privacy and security.",
      "Describe major international public policy positions and the impact they have on organizations and individuals."
    ]
  },
  {
    "name": "Organizational Security",
    "key": "",
    "outcomes": [
      "Describe risk management techniques to identify and prioritize risk factors for information assets and how risk is assessed.",
      "Describe information security policy and its role in a successful information security program.",
      "Describe why ethical codes of conduct are important to cybersecurity professionals and their organizations.",
      "Describe the principal components of cybersecurity system implementation planning.",
      "Describe popular methodologies used in the industry to manage risk.",
      "Describe the major types of information security policy and the major components of each.",
      "Discuss the importance, benefits, and desired outcomes of cybersecurity governance and how such a program would be implemented.",
      "Explain strategic organizational planning for cybersecurity and its relationship to organization-wide and IT strategic planning.",
      "Identify significant national and international laws that relate to cybersecurity.",
      "Explain how organizations achieve compliance with national and international laws and regulations, and specific industry standards.",
      "Differentiate between law and ethics.",
      "Explain what is necessary to develop, implement, and maintain effective policy and what consequences the organization may face if it does not do so.",
      "Describe risk management and its role in the organization.",
      "Discuss the strategy options used to treat risk and be prepared to select from them when given background information.",
      "Identify the key organizational stakeholders and their roles."
    ]
  },
  {
    "name": "Human Security",
    "key": "",
    "outcomes": [
      "Discuss the importance of protection of Sensitive Personal Data (SPD) and Personally Identifiable Information (PII).",
      "Describe the major topics within Security Education, Training, and Awareness (SETA) programs.",
      "Demonstrate the ability to implement approaches for detection and mitigation of social engineering attacks.",
      "Discuss the importance of social media privacy and security.",
      "Demonstrate overall understanding of the types of social engineering attacks, psychology of social engineering attacks, and misleading users.",
      "Compare and contrast various theories of privacy from social psychology and social science.",
      "Discuss the importance of risk perception and communication in the context of mental models of cybersecurity and privacy.",
      "Discuss the importance of audit trails and logging in identification and authentication.",
      "Demonstrate the ability to implement the concept of least privilege and segregation of duties.",
      "Describe the concepts of personal tracking and digital footprint, while understanding the invasiveness of such tools in the context of privacy.",
      "Demonstrate the overall understanding of access control attacks and mitigation measures.",
      "Demonstrate the ability to identify types of social engineering attacks.",
      "Explain the difference between identification, authentication, and access authorization of people and devices.",
      "Discuss the importance of SETA as countermeasures.",
      "Discuss the importance of cyber hygiene, cybersecurity user education, as well as cyber vulnerabilities and threats awareness.",
      "Describe the concepts of privacy tradeoffs and risks in the social context, control and awareness of data consent, personal information monitoring, regulatory protections and concerns on maintaining social privacy."
    ]
  }
]